src/cf/Documents/ПлатежнаяСсылкаСБПc2b.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПлатежнаяСсылкаСБПc2b</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОснованиеПлатежа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОперацииСБП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ИдентификаторыОперацийСБПc2b.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыОперацийСБПc2b</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор заказа на оплату в системе СБП</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции в UTC</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыАктивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМерчанта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеПолучениеСтатуса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОперацииСБП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ПлатежнаяСсылкаСБПc2b/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает параметры оплаты частичной оплаты.
//
// Параметры:
//  ПлатежнаяСсылкаСБП - Документ.ПлатежнаяСсылкаСБПc2b - документ частичной оплаты;
//
// Возвращаемое значение:
//  Структура - данные оплат по документу в Системе быстрых платежей:
//    * ДокументОснование - ОпределяемыйТип.ДокументОперацииСБП - документ,
//      который отражает продажу в информационной базе;
//
Функция ПараметрыОплатыПлатежнойСсылки(ПлатежнаяСсылкаСБП) Экспорт
	
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПлатежнаяСсылкаСБП, "ОснованиеПлатежа");
	
	ПараметрыОплаты = Новый Структура;
	ПараметрыОплаты.Вставить("ДокументОснование", ДокументОснование);
	
	Возврат ПараметрыОплаты;
	
КонецФункции

// Возвращает данные частичных оплат по документу основанию платежа.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//    продажу в информационной базе;
//
// Возвращаемое значение:
//  Массив Из Структура - данные частичных оплат по документу основания в Системе быстрых платежей:
//    * Ссылка - Документ.ПлатежнаяСсылкаСБПc2b - документ частичной оплаты;
//    * Дата - Дата - Дата создания частичной оплаты;
//    * Сумма - Число - Сумма частичной оплаты;
//    * СтатусОперации - Строка - идентификатор статуса операции;
//    * НастройкаПодключения -  СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//       настройка выполнения операции СБП;
//    * ПредставлениеОперации - Строка - Представление частичной оплаты (содержит дату и сумму операции).
//
Функция ПолучитьДанныеЧастичныхОплат(ОснованиеПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлатежнаяСсылкаСБПc2b.Ссылка КАК Ссылка,
	|	ПлатежнаяСсылкаСБПc2b.Дата КАК Дата,
	|	ПлатежнаяСсылкаСБПc2b.Сумма КАК Сумма,
	|	ЕСТЬNULL(ИдентификаторыОперацийСБПc2b.СтатусОперации, """") КАК СтатусОперации,
	|	ИдентификаторыОперацийСБПc2b.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Документ.ПлатежнаяСсылкаСБПc2b КАК ПлатежнаяСсылкаСБПc2b
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОперацийСБПc2b КАК ИдентификаторыОперацийСБПc2b
	|		ПО ПлатежнаяСсылкаСБПc2b.Ссылка = ИдентификаторыОперацийСБПc2b.ДокументОперации
	|ГДЕ
	|	ПлатежнаяСсылкаСБПc2b.ОснованиеПлатежа = &ОснованиеПлатежа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПлатежнаяСсылкаСБПc2b.МоментВремени";
	
	Запрос.УстановитьПараметр("ОснованиеПлатежа",     ОснованиеПлатежа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеЧастичныхОплат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеЧастичнойОплаты = Новый Структура;
		ОписаниеЧастичнойОплаты.Вставить("Ссылка",               Выборка.Ссылка);
		ОписаниеЧастичнойОплаты.Вставить("Дата",                 Выборка.Дата);
		ОписаниеЧастичнойОплаты.Вставить("Сумма",                Выборка.Сумма);
		ОписаниеЧастичнойОплаты.Вставить("СтатусОперации",       Выборка.СтатусОперации);
		ОписаниеЧастичнойОплаты.Вставить("НастройкаПодключения", Выборка.НастройкаПодключения);
		
		ОписаниеЧастичнойОплаты.Вставить(
			"ПредставлениеОперации",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Оплата от %1 на сумму %2 руб.'"),
				Выборка.Дата,
				Выборка.Сумма));
		
		ДанныеЧастичныхОплат.Добавить(ОписаниеЧастичнойОплаты);
		
	КонецЦикла;
	
	Возврат ДанныеЧастичныхОплат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
